<?php

use Illuminate\Database\Seeder;

class SongsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $types = [
            [
                'id'         => 1,
                'name' => 'Интро',
                'genre_id' => '1'
            ],
            [
                'id'         => 2,
                'name' => 'КороЧЕ',
                'genre_id' => '1'
            ],
            [
                'id'         => 3,
                'name' => 'Лес',
                'genre_id' => '1'
            ],
            [
                'id'         => 4,
                'name' => 'Не путай',
                'genre_id' => '1'
            ],
            [
                'id'         => 5,
                'name' => 'Беги',
                'genre_id' => '1'
            ],
            [
                'id'         => 6,
                'name' => 'Бэйби бой',
                'genre_id' => '1'
            ],
            [
                'id'         => 7,
                'name' => 'Ролексы',
                'genre_id' => '1'
            ],
            [
                'id'         => 8,
                'name' => 'Роза ветров',
                'genre_id' => '1'
            ],
            [
                'id'         => 9,
                'name' => 'Прикури от ствола',
                'genre_id' => '1'
            ],
            [
                'id'         => 10,
                'name' => 'Окраина',
                'genre_id' => '1'
            ],
            [
                'id'         => 11,
                'name' => 'А зори здесь тихие',
                'genre_id' => '2'
            ],
            [
                'id'         => 12,
                'name' => 'Атас',
                'genre_id' => '2'
            ],
            [
                'id'         => 13,
                'name' => 'Бабушка',
                'genre_id' => '2'
            ],
            [
                'id'         => 14,
                'name' => 'Батька Махно',
                'genre_id' => '2'
            ],
            [
                'id'         => 15,
                'name' => 'Белый Лебедь',
                'genre_id' => '2'
            ],
            [
                'id'         => 16,
                'name' => 'Берёзы',
                'genre_id' => '2'
            ],
            [
                'id'         => 17,
                'name' => 'Было время, был я беден',
                'genre_id' => '2'
            ],
            [
                'id'         => 18,
                'name' => 'Давай Наяривай',
                'genre_id' => '2'
            ],
            [
                'id'         => 19,
                'name' => 'Давай За',
                'genre_id' => '2'
            ],
            [
                'id'         => 20,
                'name' => 'Дед',
                'genre_id' => '2'

            ],
            [
                'id'         => 21,
                'name' => 'Как ты прекрасна',
                'genre_id' => '3',

            ],
            [
                'id'         => 22,
                'name' => 'Пальма де Майорка',
                'genre_id' => '3',

            ],
            [
                'id'         => 23,
                'name' => 'Контрасты',
                'genre_id' => '3',

            ],
            [
                'id'         => 24,
                'name' => 'Затерянный берег (ст. К. Арсенев)',
                'genre_id' => '3',

            ],
            [
                'id'         => 25,
                'name' => 'Ветка каштана (ст. Е. Муравьёв)',
                'genre_id' => '3',

            ],
            [
                'id'         => 26,
                'name' => 'Хрустальный бокал (ст. Т. Назарова)',
                'genre_id' => '3',

            ],
            [
                'id'         => 27,
                'name' => 'Москва слезам не верит (ст. И. Николаев)',
                'genre_id' => '3',

            ],
            [
                'id'         => 28,
                'name' => 'Мой друг (ст. И. Николаев)',
                'genre_id' => '3'
            ],
            [
                'id'         => 29,
                'name' => 'Третье сентября (ст. И. Николаев)',
                'genre_id' => '3',

            ],
            [
                'id'         => 30,
                'name' => 'Навсегда (ст. И. Седов)',
                'genre_id' => '3',

            ],
            [
                'id'         => 31,
                'name' => 'Маленькое кафе (ст. Л. Фадеев)',
                'genre_id' => '3',

            ],
            [
                'id'         => 32,
                'name' => 'Пусть тебе приснится Пальма-де-Майорка (ст. Л. Фадеев)',
                'genre_id' => '3',

            ],
            [
                'id'         => 33,
                'name' => 'В море ходят пароходы (ст. И. Шаферан)',
                'genre_id' => '3',
            ],
            [
                'id'         => 34,
                'name' => 'Затерянный берег (ст. К. Арсенев)',
                'genre_id' => '3',

            ],
            [
                'id'         => 35,
                'name' => 'Бай-бай',
                'genre_id' => '4',

            ],
            [
                'id'         => 36,
                'name' => 'Беги, беги',
                'genre_id' => '4',

            ],
            [
                'id'         => 37,
                'name' => 'Бог тебя выдумал',
                'genre_id' => '4',

            ],
            [
                'id'         => 38,
                'name' => 'Будет все',
                'genre_id' => '4'
            ],
            [
                'id'         => 39,
                'name' => 'В облаках',
                'genre_id' => '4',

            ],
            [
                'id'         => 40,
                'name' => 'Вздох – взгляд',
                'genre_id' => '4',

            ],
            [
                'id'         => 41,
                'name' => 'Взлетай',
                'genre_id' => '4',

            ],
            [
                'id'         => 42,
                'name' => 'Вокзал на двоих',
                'genre_id' => '4',

            ],
            [
                'id'         => 43,
                'name' => 'Долгими разговорами',
                'genre_id' => '4',
            ],
            [
                'id'         => 44,
                'name' => 'Домой',
                'genre_id' => '4',

            ],
            [
                'id'         => 45,
                'name' => 'Другая причина',
                'genre_id' => '4',

            ],
            [
                'id'         => 46,
                'name' => 'Её звали Америка',
                'genre_id' => '4',
            ]
        ];

        DB::table('Songs')->insert($types);
    }
}
