<?php

use Illuminate\Database\Seeder;

class SongsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()

    {
        $types = [
            [
                'id'         => 1,
                'name' => 'Интро(Баста)',
                'genre_id' => '1'
            ],
            [
                'id'         => 2,
                'name' => 'КороЧЕ(Баста)',
                'genre_id' => '1'
            ],
            [
                'id'         => 3,
                'name' => 'Лес(Баста)',
                'genre_id' => '1'
            ],
            [
                'id'         => 4,
                'name' => 'Не путай(Баста)',
                'genre_id' => '1'
            ],
            [
                'id'         => 5,
                'name' => 'Беги(Баста)',
                'genre_id' => '1'
            ],
            [
                'id'         => 6,
                'name' => 'Бэйби бой(Баста)',
                'genre_id' => '1'
            ],
            [
                'id'         => 7,
                'name' => 'Ролексы(Баста)',
                'genre_id' => '1'
            ],
            [
                'id'         => 8,
                'name' => 'Роза ветров(Баста)',
                'genre_id' => '1'
            ],
            [
                'id'         => 9,
                'name' => 'Прикури от ствола(Баста)',
                'genre_id' => '1'
            ],
            [
                'id'         => 10,
                'name' => 'Окраина(Баста)',
                'genre_id' => '1'
            ],
            [
                'id'         => 11,
                'name' => 'А зори здесь тихие(Любэ)',
                'genre_id' => '2'
            ],
            [
                'id'         => 12,
                'name' => 'Атас(Любэ)',
                'genre_id' => '2'
            ],
            [
                'id'         => 13,
                'name' => 'Бабушка(Любэ)',
                'genre_id' => '2'
            ],
            [
                'id'         => 14,
                'name' => 'Батька Махно(Любэ)',
                'genre_id' => '2'
            ],
            [
                'id'         => 15,
                'name' => 'Белый Лебедь(Любэ)',
                'genre_id' => '2'
            ],
            [
                'id'         => 16,
                'name' => 'Берёзы(Любэ)',
                'genre_id' => '2'
            ],
            [
                'id'         => 17,
                'name' => 'Было время, был я беден(Любэ)',
                'genre_id' => '2'
            ],
            [
                'id'         => 18,
                'name' => 'Давай Наяривай(Любэ)',
                'genre_id' => '2'
            ],
            [
                'id'         => 19,
                'name' => 'Давай За(Любэ)',
                'genre_id' => '2'
            ],
            [
                'id'         => 20,
                'name' => 'Дед(Любэ)',
                'genre_id' => '2'

            ],
            [
                'id'         => 21,
                'name' => 'Как ты прекрасна(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 22,
                'name' => 'Пальма де Майорка(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 23,
                'name' => 'Контрасты(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 24,
                'name' => 'Затерянный берег (ст. К. Арсенев)(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 25,
                'name' => 'Ветка каштана (ст. Е. Муравьёв)(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 26,
                'name' => 'Хрустальный бокал (ст. Т. Назарова)(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 27,
                'name' => 'Москва слезам не верит (ст. И. Николаев)(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 28,
                'name' => 'Мой друг (ст. И. Николаев)(Игорь Крутой)',
                'genre_id' => '3'
            ],
            [
                'id'         => 29,
                'name' => 'Третье сентября (ст. И. Николаев)(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 30,
                'name' => 'Навсегда (ст. И. Седов)(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 31,
                'name' => 'Маленькое кафе (ст. Л. Фадеев)(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 32,
                'name' => 'Пусть тебе приснится Пальма-де-Майорка (ст. Л. Фадеев)(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 33,
                'name' => 'В море ходят пароходы (ст. И. Шаферан)(Игорь Крутой)',
                'genre_id' => '3',
            ],
            [
                'id'         => 34,
                'name' => 'Затерянный берег (ст. К. Арсенев)(Игорь Крутой)',
                'genre_id' => '3',

            ],
            [
                'id'         => 35,
                'name' => 'Бай-бай(Не пара)',
                'genre_id' => '4',

            ],
            [
                'id'         => 36,
                'name' => 'Беги, беги(Не пара)',
                'genre_id' => '4',

            ],
            [
                'id'         => 37,
                'name' => 'Бог тебя выдумал(Не пара)',
                'genre_id' => '4',

            ],
            [
                'id'         => 38,
                'name' => 'Будет все(Не пара)',
                'genre_id' => '4'
            ],
            [
                'id'         => 39,
                'name' => 'В облаках(Не пара)',
                'genre_id' => '4',

            ],
            [
                'id'         => 40,
                'name' => 'Вздох – взгляд(Не пара)',
                'genre_id' => '4',

            ],
            [
                'id'         => 41,
                'name' => 'Взлетай(Не пара)',
                'genre_id' => '4',

            ],
            [
                'id'         => 42,
                'name' => 'Вокзал на двоих(Не пара)',
                'genre_id' => '4',

            ],
            [
                'id'         => 43,
                'name' => 'Долгими разговорами(Не пара)',
                'genre_id' => '4',
            ],
            [
                'id'         => 44,
                'name' => 'Домой(Не пара)',
                'genre_id' => '4',

            ],
            [
                'id'         => 45,
                'name' => 'Другая причина(Не пара)',
                'genre_id' => '4',

            ],
            [
                'id'         => 46,
                'name' => 'Её звали Америка(Не пара)',
                'genre_id' => '4',
            ]
        ];

        DB::table('Songs')->insert($types);
    }
}
